vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1046_DFP.pdsc
    <condition id="driver.qtmr_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.rtwdog.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.sai_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.sai, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.sai, device=MIMXRT1046.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.semc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.snvs_hp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.snvs_lp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.spdif.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.spdif_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.spdif, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.spdif, device=MIMXRT1046.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spdif"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.src.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.tempmon.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT1046.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.trng.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1046.internal_condition"/>
    </condition>
    <condition id="driver.usdhc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1046xxxxB.internal_condition"/>
    </condition>
    <condition id="driver.video-common.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1046.internal_condition"/>
    </condition>
