vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1046_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rd_rw61x" Cversion="1.0.0" condition="component.wifi_bt_module.board_rd_rw61x.condition_id">
      <description>RD-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_RW610
#define WIFI_BOARD_RW610 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_rd_rw61x_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w2_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id">
      <description>UBX-JODY-W2-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #define WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w2_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_m2.condition_id">
      <description>UBX-JODY-W5-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #define WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_usd.condition_id">
      <description>UBX-JODY-W5-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #define WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_lily_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_lily_w1_usd.condition_id">
      <description>UBX-LILY-W1-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_lily_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_maya_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_maya_w1_usd.condition_id">
      <description>UBX-MAYA-W1-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #define WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_maya_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bt_only_fw" Cversion="1.0.0" condition="component.wifi_bt_module.bt_only_fw.condition_id">
      <description>BT only firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_BT_ONLY_DNLD
        #define CONFIG_BT_ONLY_DNLD
        #endif
        #ifndef CONFIG_BT_IND_DNLD
        #define CONFIG_BT_IND_DNLD 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.bt_only_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config" Cversion="1.0.0" condition="component.wifi_bt_module.config.condition_id">
      <description>Wi-Fi and BT module configs</description>
      <files>
        <file category="header" name="components/wifi_bt_module/incl/wifi_bt_module_config.h" projectpath="component/wifi_bt_module/incl"/>
        <file category="include" name="components/wifi_bt_module/incl/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1046_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1046_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1046/MIMXRT1046.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1046/MIMXRT1046_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1046/MIMXRT1046_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_ADC_ETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_AIPSTZ.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_BEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CCM_ANALOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CM7_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_CSU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_DCP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_DMAMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_ENC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_ENET.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_FLEXRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_GPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_IOMUXC_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_IOMUXC_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_IOMUXC_SNVS_GPR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_PGC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_PIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_PXP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_SNVS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_SRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_TEMPMON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_TRNG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_USB_ANALOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_WDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_XBARA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_XBARB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1046/periph/PERI_XTALOSC24M.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT1046/"/>
        <file category="include" name="devices/MIMXRT1046/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1046/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1046/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1046/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1046/xip/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1046_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1046_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/arm/MIMXRT1046xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1046/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/arm/MIMXRT1046xxxxx_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1046/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/arm/MIMXRT1046xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1046/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/arm/MIMXRT1046xxxxx_sdram.scf" version="1.0.0" projectpath="MIMXRT1046/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/arm/MIMXRT1046xxxxx_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1046/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/gcc/MIMXRT1046xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1046/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/gcc/MIMXRT1046xxxxx_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1046/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/gcc/MIMXRT1046xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1046/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/gcc/MIMXRT1046xxxxx_sdram.ld" version="1.0.0" projectpath="MIMXRT1046/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/gcc/MIMXRT1046xxxxx_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1046/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/iar/MIMXRT1046xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1046/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/iar/MIMXRT1046xxxxx_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1046/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/iar/MIMXRT1046xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1046/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/iar/MIMXRT1046xxxxx_sdram.icf" version="1.0.0" projectpath="MIMXRT1046/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1046xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1046/iar/MIMXRT1046xxxxx_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1046/iar"/>
      </files>
    </component>
