vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1046_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.4" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan" Cversion="2.14.4" condition="driver.flexcan.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexcan.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexcan.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan_edma" Cversion="2.12.1" condition="driver.flexcan_edma.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexcan_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexcan_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.1" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_edma" Cversion="2.1.8" condition="driver.flexio_i2s_edma.condition_id">
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_i2s_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_i2s_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_edma" Cversion="2.3.0" condition="driver.flexio_spi_edma.condition_id">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_spi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_spi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.6.4" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_edma" Cversion="2.4.1" condition="driver.flexio_uart_edma.condition_id">
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexio_uart_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexio_uart_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexram" Cversion="2.3.0" condition="driver.flexram.condition_id">
      <description>FLEXRAM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexram.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexram.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate" Cversion="2.0.2" condition="driver.flexram_allocate.condition_id">
      <description>SOC FLEXRAM ALLOCATE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_flexram_allocate.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_flexram_allocate.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
