vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1046_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.0.6" condition="driver.igpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/display/ili9341/fsl_ili9341.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ili9341/fsl_ili9341.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc" Cversion="2.0.0" condition="driver.iomuxc.condition_id">
      <description>IOMUXC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_iomuxc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.6.2" condition="driver.lpi2c.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpi2c.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpi2c.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma" Cversion="2.4.4" condition="driver.lpi2c_edma.condition_id">
      <description>LPI2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpi2c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpi2c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi" Cversion="2.7.3" condition="driver.lpspi.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma" Cversion="2.4.9" condition="driver.lpspi_edma.condition_id">
      <description>LPSPI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart" Cversion="2.10.0" condition="driver.lpuart.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpuart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpuart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma" Cversion="2.6.0" condition="driver.lpuart_edma.condition_id">
      <description>LPUART Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_lpuart_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_lpuart_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
