vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1046_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nic301" Cversion="2.0.1" condition="driver.nic301.condition_id">
      <description>NIC301 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_nic301.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.1.4" condition="driver.ocotp.condition_id">
      <description>OCOTP Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_ocotp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_ocotp.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x" Cversion="2.0.1" condition="driver.pcm186x.condition_id">
      <description>Driver pcm186x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM186X_ENABLE
#define CODEC_PCM186X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm186x/fsl_pcm186x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm186x/fsl_pcm186x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm186x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x" Cversion="2.0.1" condition="driver.pcm512x.condition_id">
      <description>Driver pcm512x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM512X_ENABLE
#define CODEC_PCM512X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm512x/fsl_pcm512x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm512x/fsl_pcm512x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm512x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550.h" projectpath="component/pmic/pf1550"/>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550_charger.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550_charger.h" projectpath="component/pmic/pf1550"/>
        <file category="include" name="components/pmic/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="sourceC" name="components/pmic/pf3000/fsl_pf3000.c" projectpath="component/pmic/pf3000"/>
        <file category="header" name="components/pmic/pf3000/fsl_pf3000.h" projectpath="component/pmic/pf3000"/>
        <file category="include" name="components/pmic/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf5020" Cversion="2.0.0" condition="driver.pf5020.condition_id">
      <description>Driver pf5020</description>
      <files>
        <file category="sourceC" name="components/pmic/pf5020/fsl_pf5020.c" projectpath="component/pmic/pf5020"/>
        <file category="header" name="components/pmic/pf5020/fsl_pf5020.h" projectpath="component/pmic/pf5020"/>
        <file category="include" name="components/pmic/pf5020/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.2.0" condition="driver.pit.condition_id">
      <description>PIT Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_pit.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_pit.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu" Cversion="2.1.1" condition="driver.pmu.condition_id">
      <description>pmu Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1046/drivers/fsl_pmu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1046/drivers/fsl_pmu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1046/drivers/"/>
      </files>
    </component>
